In [11]:
import pandas as pd  
import numpy as np

# 3. Create get_db_url function

In [2]:
def get_db_url(db_name):
    from env import user, host, password
    return f'mysql+pymysql://{user}:{password}@{host}/{db_name}'

# 4. Use function to obtain connection to employees database

In [20]:
query_emp = '''
select * from employees limit 5
'''
url_emp = get_db_url('employees')

df = pd.read_sql(query_emp, url_emp)
df

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

# 5a. Intentional database url typo

# 5b. Intentional SQL query error

# 6. Read the employees and titles tables in two separate DataFrames

In [27]:
query_titles = '''
select * from titles limit 5
'''

url_titles = get_db_url('employees')

df_titles = pd.read_sql(query_titles, url_titles)
df_titles

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [30]:
df_emp = pd.read_sql(query_emp, url_emp)
df_emp

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

# 7. How many rows and columns in each DataFrame?

In [31]:
df_emp.shape

(5, 6)

In [32]:
df_titles.shape

(5, 4)

# 8. Display summary statistics for each DataFrame

In [36]:
emp_db.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [33]:
df_titles.describe()

            emp_no
count      5.00000
mean   10002.80000
std        1.30384
min    10001.00000
25%    10002.00000
50%    10003.00000
75%    10004.00000
max    10004.00000

# 9. How many unique titles are in the titles DataFrame?

# 10. What is the oldest date in the to_date column?

# 11. What is the most recent date in the to_date column?

# Part II

# 1. Copy the users and roles DataFrames from the examples above.

In [34]:
#users df
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [35]:
#roles df
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

# 2. What is the result of using a right join on the DataFrames?

In [38]:
users.merge(roles, 
           left_on='role_id', 
           right_on='id',
           how='right',
          )

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

# 3. What is the result of using an outer join on the DataFrames?

In [ ]:
users.merge(roles, 
           left_on='role_id', 
           right_on='id',
           how='right',
          )

# 4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

# 5. Load the mpg dataset from PyDataset.

# 6. Output and read the documentation for the mpg dataset.

# 7. How many rows and columns are in the dataset?

# 8. Check out your column names and perform any cleanup you may want on them.

# 9. Display the summary statistics for the dataset.

# 10. How many different manufacturers are there?

# 11. How many different models are there?

# 12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

# 13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

# 14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

# 15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

# 16. Do automatic or manual cars have better miles per gallon?